package com.example.samojlov_av_homework_module_13_number_1

class Exercise {
    val exerciseNameList = listOf(
        "Приседания с вытягиванием рук",
        "Приседания с подъемом колена",
        "Отжимания с широкой постановкой рук",
        "Отжимания-спайдерман",
        "Подъем колена к локтям",
        "Мельница с шагами",
        "Повороты таза в планке",
        "Шаги в стороны в планке",
        "Тяга гантелей к поясу в наклоне",
        "Жим гантелей лежа"
    )
    val exerciseDescriptionList = listOf(
        "Встаньте прямо, ноги на ширине плеч, руки опущены вдоль тела ладонями к корпусу. Согните ноги в коленях, выполняя приседание до параллели с полом. В нижней точке поднимите руки перед собой для равновесия. Приседания задействуют ягодицы, бедра, икры, а также мышцы корпуса, обеспечивая общеукрепляющий эффект на организм.",
        "Поставьте ноги на ширине плеч, руки положите за голову. Выполните базовое приседания, опускаясь до параллели бедер с полом. На подъеме поднимите одно колено и коснитесь его противоположным локтем. На следующем подъеме поменяйте руку и ногу. Выполняйте это упражнение для всего тела в домашних условиях, чтобы проработать ноги, ягодицы и пресс.",
        "В упоре лежа поставьте руки в широкую постановку и из этого положения выполните отжимания от пола. Сгибайте локти под прямым углом, направляя их назад. Отжимания с широкой постановкой включены в комплекс упражнений для всего тела для мужчин, так как прорабатывают широчайшие мышцы спины в дополнение к грудным и трицепсам.",
        "Из упора лежа выполните классическое отжимание, сгибая локти под прямым углом и направляя их назад. В нижней точке согните правую ногу в колене и приведите ее к правому плечу через сторону. Вернитесь обратно и на следующем отжимании повторите другой ногой. Упражнение глубоко прорабатывает грудные и спину, а также задействует косые мышцы пресса.",
        "Стоя на месте, руки положите за голову. Поднимите левое колено и опустите ему навстречу локоть правой руки. Вернитесь обратно, а на следующем подходе поднимите правое колено, опуская к нему левый локоть. Это кардио-упражнение стимулирует жиросжигание, но также задействует косые мышцы пресса, формируя спортивный рельеф.",
        "Поставьте ноги вместе, руки поднимите над головой. Сделайте шаг вправо, одновременно наклоняясь вперед и касаясь левой рукой правой ноги. На следующем подходе сделайте шаг влево, наклоняясь к левой ноге. Упражнение включено в тренировку с собственным весом для мужчин, так как укрепляет мышцы пресса, увеличивает гибкость и выносливость.",
        "Встаньте в планку на локтях, спина и таз держите на одном уровне. Теперь поверните корпус влево, стараясь левым бедром коснуться пола. Вернитесь в начальное положение и повторите поворот в другую сторону. Выполняйте это упражнение с весом тела в домашних условиях, чтобы проработать косые мышцы пресса и сделать линию талии более четкой.",
        "Продолжайте стоять в планке на локтях, но теперь просто отставьте правую ногу на шаг от левой. Вернитесь в исходное положение и сделайте шаг в сторону левой ногой. Эта динамическая планка входит в комплекс упражнений для всего тела для мужчин, так как обеспечивает одновременно кардио и статическую нагрузку, что способствует укреплению мышц и потере веса.",
        "Работающие мышцы: Широчайшие/большие круглые/ромбовидные мышцы спины, задний пучок дельт, трапеции.\n" +
                "\n" +
                "Как выполнять: наклонитесь корпусом вперед, выполнив полуприсед. Сохраняйте осанку, не сутультесь, расправьте грудь, чтобы мышцы смотрели вперед. Гантели в руках держите молотковым хватом. Теперь подтягивайте снаряды к корпусу, локти смотрят вверх. В пиковой точке лопатки сводятся, полностью нагружая спину.\n" +
                "\n" +
                "На что обратить внимание: во избежание травм следите за ровным положение спины. Не гонитесь за слишком тяжелыми весами, поскольку нагрузка на поясницу и позвоночник и без того высока.",
        "Работающие мышцы: Большие грудные мышцы, трехглавые мышцы плеча.\n" +
                "\n" +
                "Как выполнять: Взяв снаряды, примите горизонтальное лежачее положение на лавке. Грифы гантелей взяты так, будто вы удерживаете штангу. Предплечья перпендикулярны полу. Из нижней фазы выжимайте вес, разгибая руки перед собой на 99%. При движении вниз локти разведены, смотрят четко вниз. Новый повтор начинайте после ощущения растяжения грудной мускулатуры в нижней точке.\n" +
                "\n" +
                "На что обратить внимание: это лучшее упражнение для увеличения силовых показателей и объема грудного отдела. Можно поменять местами с отжиманиями, т. е. выполнить в начале тренировки (особенно если тренируетесь с большим весом гантелей)."
    )
    val exerciseImageGifList = listOf(
        R.drawable.prisedanie_ruki_vpered,
        R.drawable.prised_koleno_lokot,
        R.drawable.otzhimaniya_shirokaya_postanovka_ruk,
        R.drawable.otzhimaniya_pauk,
        R.drawable.koleno_lokot_cardio,
        R.drawable.pristavnoj_shag_s_kasaniem_stopy,
        R.drawable.planka_na_loktyah_twist,
        R.drawable.planka_otvedenie_nog,
        R.drawable.tyga_gantelej_k_poyasu,
        R.drawable.zhim_ganteley_lezha
    )
    val exerciseTimeList = listOf(
        30,
        30,
        50,
        50,
        30,
        30,
        45,
        45,
        30,
        30
    )
}